Ci_APP1H/app/Controllers/UserCrud.php

    public function index()
    {
        $userObj = new UserModel();
        $data['myUsers'] = $userObj->orderBy('id')->findAll();
---
SELECT *
FROM `users`
ORDER BY `id`